// 当前文件夹
string rootPath = Directory.GetCurrentDirectory();
// 文件夹结构
string[] folders =
[
    @"10项目管理\10-1要件定义",
    @"10项目管理\10-2要件定义交付",
    @"10项目管理\10-3项目主计划",
    @"10项目管理\10-4项目周报",
    @"10项目管理\10-5会议纪要",
    @"20业务调研及要件定义\20-1调研计划",
    @"20业务调研及要件定义\20-2调研会议资料",
    @"20业务调研及要件定义\20-3调研会议会议纪要",
    @"20业务调研及要件定义\20-4业务需求分析",
    @"20业务调研及要件定义\20-5业务蓝图",
    @"20业务调研及要件定义\20-6课题研讨",
    @"20业务调研及要件定义\20-7功能设计\历史版本",
    @"30技术概要及详细设计",
    @"40系统测试和培训\系统测试",
    @"40系统测试和培训\用户培训",
    @"50系统上线\50-1系统切换方案",
    @"50系统上线\50-2用户及权限配置",
    @"50系统上线\50-3数据初始化",
    @"50系统上线\50-4系统上线汇报材料",
    @"60上线后运维",
    @"70_配置相关",
    @"80数据清理\80-1数据清理方案",
    @"80数据清理\80-2数据清理模板",
    @"80数据清理\80-3数据清理结果"
];
foreach (var folder in folders)
{
    string fullPath = Path.Combine(rootPath, folder);
    Directory.CreateDirectory(fullPath);
    Console.WriteLine($"创建文件夹: {fullPath}");
}
Console.WriteLine("所有文件夹已创建");